{"id":16910,"date":"2014-12-31T09:59:33","date_gmt":"2014-12-31T01:59:33","guid":{"rendered":"http:\/\/coolshell.cn\/?p=16910"},"modified":"2014-12-31T09:59:33","modified_gmt":"2014-12-31T01:59:33","slug":"linus%ef%bc%9a%e4%b8%ba%e4%bd%95%e5%af%b9%e8%b1%a1%e5%bc%95%e7%94%a8%e8%ae%a1%e6%95%b0%e5%bf%85%e9%a1%bb%e6%98%af%e5%8e%9f%e5%ad%90%e7%9a%84","status":"publish","type":"post","link":"https:\/\/coolshell.cn\/articles\/16910.html","title":{"rendered":"Linus：为何对象引用计数必须是原子的"},"content":{"rendered":"<p><strong>（感谢网友 <\/strong><a href=\"http:\/\/weibo.com\/fullofbull\" target=\"_blank\"><strong>@我的上铺叫路遥<\/strong><\/a><strong> 投稿）<\/strong><\/p>\n<p>Linus大神又在rant了！这次的吐槽对象是时下很火热的<strong>并行技术(parellism)<\/strong>，并直截了当地表示<a title=\"并行计算基本上就是浪费大家的时间\" href=\"http:\/\/www.vaikan.com\/linus-parallel-computing-is-a-huge-waste-of-everybodys-time\/\" target=\"_blank\">并行计算是浪费所有人时间<\/a>(<a href=\"http:\/\/www.realworldtech.com\/forum\/?threadid=146066&amp;curpostid=146227\">&#8220;The whole &#8220;let&#8217;s parallelize&#8221; thing is a huge waste of everybody&#8217;s time.&#8221;<\/a>)。大致意思是说<strong>乱序性能快、提高缓存容量、降功耗<\/strong>。当然笔者不打算正面讨论并行的是是非非（过于宏伟的主题），因为Linus在另一则<a title=\"reference counting\" href=\"http:\/\/www.realworldtech.com\/forum\/?threadid=146066&amp;curpostid=146183\" target=\"_blank\">帖子<\/a>中举了对象<strong>引用计数(reference counting)<\/strong>的例子来说明并行的复杂性。<\/p>\n<p>在Linus回复之前有人指出<strong>对象需要锁机制的情况下，引用计数的原子性问题：<\/strong><\/p>\n<blockquote><p>Since it is being accessed in a multi-threaded way, via multiple access paths, generally it needs its own mutex &#8212; otherwise, reference counting would not be required to be atomic and a lock of a higher-level object would suffice.<\/p>\n<p>由于（对象）通过多线程方式及多种获取渠道，一般而言它需要自身维护一个互斥锁——否则引用计数就不要求是原子的，一个更高层次的对象锁足矣。<\/p><\/blockquote>\n<p>而Linus不那么认为：<\/p>\n<blockquote><p>The problem with reference counts is that you often need to take them *before* you take the lock that protects the object data.<\/p>\n<p>引用计数的问题在于你经常需要在对象数据<strong>上锁保护之前<\/strong>完成它。<\/p><\/blockquote>\n<p>The thing is, you have two different cases:<\/p>\n<p>问题有两种情况：<\/p>\n<p style=\"padding-left: 30px;\"><strong>&#8211; object *reference* 对象引用<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>&#8211; object data 对象数据<\/strong><\/p>\n<p>and they have completely different locking.<\/p>\n<p><strong>它们锁机制是完全不一样的。<\/strong><\/p>\n<p><!--more--><\/p>\n<p>Object data locking is generally per-object. Well, unless you don&#8217;t have huge scalability issues, in which case you may have some external bigger lock (extreme case: one single global lock).<\/p>\n<p>对象数据保护一般是一个对象拥有一个锁，假设你没有海量扩展性问题，不然你需要一些外部大一点的锁（极端的例子，一个对象一个全局锁）。<\/p>\n<p>But object *referencing* is mostly about finding the object (and removing\/freeing it). Is it on a hash chain? Is it in a tree? Linked list? When the reference count goes down to zero, it&#8217;s not the object data that you need to protect (the object is not used by anything else, so there&#8217;s nothing to protect!), it&#8217;s the ways to find the object you need to protect.<\/p>\n<p>但对象引用主要关于对象的寻找（移除或释放），它是否在哈希链，一棵树或者链表上。<strong>当对象引用计数降为零，你要保护的不是对象数据，因为对象没有在其它地方使用，你要保护的是对象的寻找操作。<\/strong><\/p>\n<p>And the lock for the lookup operation cannot be in the object, because &#8211; by definition &#8211; you don&#8217;t know what the object is! You&#8217;re trying to look it up, after all.<\/p>\n<p>而且查询操作的锁不可能在对象内部，因为根据定义，你还不知道这是什么对象，你在尝试寻找它。<\/p>\n<p>So generally you have a lock that protects the lookup operation some way, and the reference count needs to be atomic with respect to that lock.<\/p>\n<p>因此一般你要对查询操作上锁，而且引用计数相对<strong>那个锁<\/strong>来说是原子的（译者注：查询锁不是引用计数所在的对象所有，不能保护对象引用计数，后面会解释为何引用计数变更时其所在对象不能上锁）。<\/p>\n<p>And yes, that lock may well be sufficient, and now you&#8217;re back to non-atomic reference counts. But you usually don&#8217;t have just one way to look things up: you might have pointers from other objects (and that pointer is protected by the object locking of the other object), but there may be multiple such objects that point to this (which is why you have a reference count in the first place!)<\/p>\n<p>当然这个锁是充分有效的，现在假设引用计数是非原子的，但你常常不仅仅使用一种方式来查询：你可能拥有其它对象的指针（这个指针又被其它对象的对象锁给保护起来），但同时还会有多个对象指向它（这就是为何你第一时间需要引用计数的理由）。<\/p>\n<p>See what happens? There is no longer one single lock for lookup. Imagine walking a graph of objects, where objects have pointers to each other. Each pointer implies a reference to an object, but as you walk the graph, you have to release the lock from the source object, so you have to take a new reference to the object you are now entering.<\/p>\n<p>看看会发生什么？查询不止存在一个锁保护。你可以想象走过一张对象流程图，其中对象存在指向其它对象的指针，每个指针暗含了一次对象引用，但当你走过这个流程图，你必须释放源对象的锁，而你进入新对象时又必须增加一次引用。<\/p>\n<p>And in order to avoid deadlocks, you can not in the general case take the lock of the new object first &#8211; you have to release the lock on the source object, because otherwise (in a complex graph), how do you avoid simple ABBA deadlock?<\/p>\n<p>而且为了避免死锁，你一般不能立即对新对象上锁——你必须释放源对象的锁，否则在一个复杂流程图里，你如何避免<strong>ABBA死锁<\/strong>（译者注：假设两个线程，一个是A-&gt;B，另一个B-&gt;;A，当线程一给A上锁，线程二给B上锁，此时两者谁也无法释放对方的锁）？<\/p>\n<p>So atomic reference counts fix that. They work because when you move from object A to object B, you can do this:<\/p>\n<p>原子引用计数修正了这一点，当你从对象A到对象B，你会这样做：<\/p>\n<p>(a) you have a reference count to A, and you can lock A<\/p>\n<p style=\"padding-left: 30px;\">对象A增加一次引用计数，并上锁。<\/p>\n<p>(b) once object A is locked, the pointer from A to B is stable, and you know you have a reference to B (because of that pointer from A to B)<\/p>\n<p style=\"padding-left: 30px;\">对象A一旦上锁，A指向B的指针就是稳定的，于是你知道你引用了对象B。<\/p>\n<p>(c) but you cannot take the object lock for B (ABBA deadlock) while holding the lock on A<\/p>\n<p style=\"padding-left: 30px;\">但你不能在对象A上锁期间给B上锁（ABBA死锁）。<\/p>\n<p>(d) increment the atomic reference count on B<\/p>\n<p style=\"padding-left: 30px;\">对象B增加一次原子引用计数。<\/p>\n<p>(e) now you can drop the lock on A (you&#8217;re &#8220;exiting&#8221; A)<\/p>\n<p style=\"padding-left: 30px;\">现在你可以扔掉对象A的锁（退出对象A）。<\/p>\n<p>(f) your reference count means that B cannot go away from under you despite unlocking A, so now you can lock B.<\/p>\n<p style=\"padding-left: 30px;\">对象B的原子引用计数意味着即使给A解锁期间，B也不会失联，现在你可以给B上锁。<\/p>\n<p>See? Atomic reference counts make this kind of situation possible. Yes, you want to avoid the overhead if at all possible (for example, maybe you have a strict ordering of objects, so you know you can walk from A to B, and never walk from B to A, so there is no ABBA deadlock, and you can just lock B while still holding the lock on A).<\/p>\n<p>看见了吗？原子引用计数使这种情况成为可能。是的，你想尽一切办法避免这种代价，比如，你也许把对象写成严格顺序的，这样你可以从A到B，绝不会从B到A，如此就不存在ABBA死锁了，你也就可以在A上锁期间给B上锁了。<\/p>\n<p>But if you don&#8217;t have some kind of forced ordering, and if you have multiple ways to reach an object (and again &#8211; why have reference counts in the first place if that isn&#8217;t true!) then atomic reference counts really are the simple and sane answer.<\/p>\n<p>但如果你无法做到这种强迫序列，如果你有多种方式接触一个对象（再一次强调，这是第一时间使用引用计数的理由），这样，原子引用计数就是简单又理智的答案。<\/p>\n<p>If you think atomic refcounts are unnecessary, that&#8217;s a big flag that you don&#8217;t actually understand the complexities of locking.<\/p>\n<p><strong>如果你认为原子引用计数是不必要的，这就大大说明你实际上不了解锁机制的复杂性。<\/strong><\/p>\n<p>Trust me, concurrency is hard. There&#8217;s a reason all the examples of &#8220;look how easy it is to parallelize things&#8221; tend to use simple arrays and don&#8217;t ever have allocations or freeing of the objects.<\/p>\n<p>相信我，<strong>并发设计是困难的。<\/strong>所有关于“并行化如此容易”的理由都倾向于使用简单数组操作做例子，甚至不包含对象的分配和释放。<\/p>\n<p>People who think that the future is highly parallel are invariably completely unaware of just how hard concurrency really is. They&#8217;ve seen Linpack, they&#8217;ve seen all those wonderful examples of sorting an array in parallel, they&#8217;ve seen all these things that have absolutely no actual real complexity &#8211; and often very limited real usefulness.<\/p>\n<p>那些认为未来是高度并行化的人一成不变地完全没有意识到并发设计是多么困难。他们只见过<a title=\"Linpack\" href=\"http:\/\/en.wikipedia.org\/wiki\/LINPACK\" target=\"_blank\">Linpack<\/a>，他们只见过并行技术中关于数组排序的一切精妙例子，他们只见过一切绝不算真正复杂的事物——对真正的用处经常是非常有限的。<\/p>\n<p>（译者注：当然，我无意借大神之口把技术宗教化。实际上Linus又在另一篇<a title=\"评价\" href=\"http:\/\/www.realworldtech.com\/forum\/?threadid=146066&amp;curpostid=146198\" target=\"_blank\">帖子<\/a>中综合了对并行的评价。）<\/p>\n<p>Oh, I agree. My example was the simple case. The really complex cases are much worse.<\/p>\n<p>哦，我同意。我的例子还算简单，真正复杂的用例更糟糕。<\/p>\n<p>I seriously don&#8217;t believe that the future is parallel. People who think you can solve it with compilers or programming languages (or better programmers) are so far out to lunch that it&#8217;s not even funny.<\/p>\n<p>我严重不相信未来是并行的。有人认为你可以通过编译器，编程语言或者更好的程序员来解决问题，他们目前都是神志不清，没意识到这一点都不有趣。<\/p>\n<p>Parallelism works well in simplified cases with fairly clear interfaces and models. You find parallelism in servers with independent queries, in HPC, in kernels, in databases. And even there, people work really hard to make it work at all, and tend to expressly limit their models to be more amenable to it (eg databases do some things much better than others, so DB admins make sure that they lay out their data in order to cater to the limitations).<\/p>\n<p>并行计算可以在简化的用例以及具备清晰的接口和模型上正常工作。你发现并行在服务器上独立查询里，在高性能计算(High-performance computing)里，在内核里，在数据库里。即使如此，人们还得花很大力气才能使它工作，并且还要明确限制他们的模型来尽更多义务（例如数据库要想做得更好，数据库管理员得确保数据得到合理安排来迎合局限性）。<\/p>\n<p>Of course, other programming models can work. Neural networks are inherently very parallel indeed. And you don&#8217;t need smarter programmers to program them either..<\/p>\n<p>当然，其它编程模型倒能派上用场，神经网络(neural networking)天生就是非常并行化的，你不需要更聪明的程序员为之写代码。<\/p>\n<h4>参考资料<\/h4>\n<ul>\n<li><a title=\"Real World Technologies\" href=\"http:\/\/www.realworldtech.com\/\" target=\"_blank\">Real World Technologies<\/a>：Linus常去“灌水”的一个论坛，讨论未来机器架构（看名字就知道Linus技术偏好，及其之前对虚拟化技术(virtualization)的<a title=\"virtualization is evil\" href=\"http:\/\/www.networkworld.com\/article\/2220440\/opensource-subnet\/torvalds-says---virtualization-is-evil-.html\" target=\"_blank\">吐槽<\/a>）<\/li>\n<li><a title=\"多线程程序中操作的原子性\" href=\"http:\/\/www.parallellabs.com\/2010\/04\/15\/atomic-operation-in-multithreaded-application\/\" target=\"_blank\">多线程程序中操作的原子性<\/a>：解释为什么i++不是原子操作<\/li>\n<li><a title=\"Concurrency Is Not Parallelism\" href=\"http:\/\/www.vaikan.com\/docs\/Concurrency-is-not-Parallelism\" target=\"_blank\"> Concurrency Is Not Parallelism<\/a>：Go语言之父Rob Pike幻灯片解释“并发”与“并行”概念上的区别<\/li>\n<\/ul>\n<p>（全文完）<\/p>\n","raw":"","protected":false},"excerpt":{"rendered":"<p>（感谢网友 @我的上铺叫路遥 投稿） Linus大神又在rant了！这次的吐槽对象是时下很火热的并行技术(parellism)，并直截了当地表示并行计算是浪费所&#8230;<\/p>\n<p class=\"read-more\"><a class=\"btn btn-default\" href=\"https:\/\/coolshell.cn\/articles\/16910.html\"> Read More<span class=\"screen-reader-text\">  Read More<\/span><\/a><\/p>\n","protected":false},"author":15168,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[23,3],"tags":[774,775,183,608,776],"series":[],"aioseo_notices":[],"views":50897,"post_thumbnail_image":"","content_first_image":"","post_medium_image_300":"","post_thumbnail_image_624":"","post_frist_image":"","post_medium_image":"","post_large_image":"","post_full_image":"","post_all_images":[],"videoAdId":"","listAd":"0","listAdId":"","listAdEvery":5,"total_comments":37,"category_name":"程序设计","post_date":"2014-12-31","like_count":"0","praiseWord":"鼓励","excitationAd":"0","rewardedVideoAdId":"","detailAdId":"","detailAd":"0","enterpriseMinapp":"0","audios":[],"postImageUrl":"http:\/\/coolshell.cn\/wp-content\/uploads\/2016\/09\/coolshell-360x200.jpg","avatarurls":[],"related_posts":[],"pageviews":50898,"pageviews_wl":48017,"ratings_average":3,"ratings_total":161,"ratings_users":42,"next_post_id":17066,"next_post_title":"关于移动端的钓鱼式攻击","previous_post_id":12052,"previous_post_title":"Leetcode 编程训练"}