{"id":3345,"date":"2010-12-02T08:44:24","date_gmt":"2010-12-02T00:44:24","guid":{"rendered":"http:\/\/coolshell.cn\/?p=3345"},"modified":"2011-04-11T08:03:22","modified_gmt":"2011-04-11T00:03:22","slug":"140%e4%b8%aagoogle%e7%9a%84%e9%9d%a2%e8%af%95%e9%a2%98","status":"publish","type":"post","link":"https:\/\/coolshell.cn\/articles\/3345.html","title":{"rendered":"140个Google的面试题"},"content":{"rendered":"<p>来源：<a href=\"http:\/\/blog.seattleinterviewcoach.com\/2009\/02\/140-google-interview-questions.html\" target=\"_blank\">http:\/\/blog.seattleinterviewcoach.com\/2009\/02\/140-google-interview-questions.html<\/a>（墙）<br \/>\n<img decoding=\"async\" loading=\"lazy\" class=\"alignright size-medium wp-image-3349\" title=\"Google 面试题 \" src=\"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion-300x225.jpg\" alt=\"\" width=\"210\" height=\"158\" srcset=\"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion-300x225.jpg 300w, https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion-360x270.jpg 360w, https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg 400w\" sizes=\"(max-width: 210px) 100vw, 210px\" \/><\/p>\n<div>某猎头收集了140多个Google的面试题，都张到他的Blog中了，主要是下面这些职位的，因为被墙，且无任何敏感信息，所以，我原文搬过来了。<\/div>\n<div>\n<ul>\n<li>Product Marketing Manager<\/li>\n<li>Product Manager<\/li>\n<li>Software Engineer<\/li>\n<li>Software Engineer in Test<\/li>\n<li>Quantitative Compensation Analyst<\/li>\n<li>Engineering Manager<\/li>\n<li>AdWords Associate<\/li>\n<\/ul>\n<\/div>\n<p>这篇Blog例举了Google用来面试下面这几个职位的面试题。很多不是很容易回答，不过都比较经典与变态，是Google，Microsoft，Amazon之类的公司的风格。对于本文，我没有翻译，因为我相信，英文问题是最好的。不过对于有些问题，我做了一些注释，不一定对，但希望对你有帮助启发。对于一些问题，如果你百思不得其解，可以Google一下，StackOverflow或是Wikipedia上可能会给你非常全面的答案。<\/p>\n<p><!--more--><\/p>\n<div><strong>Product Marketing Manager<\/strong><\/div>\n<div>\n<div>\n<ul>\n<li>Why do you want to join Google?<\/li>\n<li>What do you know about Google&#8217;s product and technology?<\/li>\n<li>If you are Product Manager for Google&#8217;s Adwords, how do you plan to market this?<\/li>\n<li>What would you say during an AdWords or AdSense product seminar?<\/li>\n<li>Who are Google&#8217;s competitors, and how does Google compete with them?<\/li>\n<li>Have you ever used Google&#8217;s products? Gmail?<\/li>\n<li>What&#8217;s a creative way of marketing Google&#8217;s brand name and product?<\/li>\n<li>If you are the product marketing manager for Google&#8217;s Gmail product, how do you plan to market it so as to achieve 100 million customers in 6 months?<\/li>\n<li>How much money you think Google makes daily from Gmail ads?<\/li>\n<li>Name a piece of technology you’ve read about recently. Now tell me your own creative execution for an ad for that product.<\/li>\n<li>Say an advertiser makes $0.10 every time someone clicks on their ad.  Only 20% of people who visit the site click on their ad.  How many people need to visit the site for the advertiser to make $20?<span style=\"white-space: pre;\"> <\/span><\/li>\n<li>Estimate the number of students who are college seniors, attend four-year schools, and graduate with a job in the United States every year.<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div><strong>Product Manager<\/strong><\/div>\n<div>\n<div>\n<ul>\n<li>How would you boost the GMail subscription base?<\/li>\n<li>What is the most efficient way to sort a million integers?  （陈皓：merge sort）<\/li>\n<li>How would you re-position Google&#8217;s offerings to counteract competitive threats from Microsoft?<\/li>\n<li>How many golf balls can fit in a school bus? （陈皓：这种题一般来说是考你的解题思路的，注意，你不能单纯地把高尔夫球当成一个小立方体，其是一个圆球，堆起来的时候应该是错开的——也就是三个相邻的球的圆心是个等边三角形）<\/li>\n<li>You are shrunk to the height of a nickel and your mass is proportionally reduced so as to maintain your original density. You are then thrown into an empty glass blender. The blades will start moving in 60 seconds. What do you do?<\/li>\n<li>How much should you charge to wash all the windows in Seattle?<\/li>\n<li>How would you find out if a machine’s stack grows up or down in memory?<\/li>\n<li>Explain a database in three sentences to your eight-year-old nephew. （陈皓：用三句话向8岁的侄子解释什么是数据库，考你的表达能力了）<\/li>\n<li>How many times a day does a clock’s hands overlap?（陈皓：经典的时钟问题）<\/li>\n<li>You have to get from point A to point B. You don’t know if you can get there. What would you do?<\/li>\n<li>Imagine you have a closet full of shirts. It’s very hard to find a shirt. So what can you do to organize your shirts for easy retrieval? （陈皓：很不错的一道题，不要以为分类查询很容易，想想图书馆图书的分类查询问题吧。另外，你处想想如何在你在你的衣柜里实现一个相当于Hash表或是一个Tree之类的数据结构）<\/li>\n<li>Every man in a village of 100 married couples has cheated on his wife. Every wife in the village instantly knows when a man other than her husband has cheated, but does not know when her own husband has. The village has a law that does not allow for adultery. Any wife who can prove that her husband is unfaithful must kill him that very day. The women of the village would never disobey this law. One day, the queen of the village visits and announces that at least one husband has been unfaithful. What happens? （陈皓：这个问题很有限制级，哈哈，非常搞的一个问题，注意wife们的递归，这类的问题是经典的分布式通讯问题，上网搜 一搜吧。）<\/li>\n<li>In a country in which people only want boys, every family continues to have children until they have a boy. If they have a girl, they have another child. If they have a boy, they stop. What is the proportion of boys to girls in the country?（陈皓：第一反应是——这个国家是中国。一个概率问题，其实，无论你怎么生，50%的概率是永远不变的。）<\/li>\n<li>If the probability of observing a car in 30 minutes on a highway is 0.95, what is the probability of observing a car in 10 minutes (assuming constant default probability)?<\/li>\n<li>If you look at a clock and the time is 3:15, what is the angle between the hour and the minute hands? (The answer to this is not zero!)<\/li>\n<li>Four people need to cross a rickety rope bridge to get back to their camp at night. Unfortunately, they only have one flashlight and it only has enough light left for seventeen minutes. The bridge is too dangerous to cross without a flashlight, and it&#8217;s only strong enough to support two people at any given time. Each of the campers walks at a different speed. One can cross the bridge in 1 minute, another in 2 minutes, the third in 5 minutes, and the slow poke takes 10 minutes to cross. How do the campers make it across in 17 minutes?（陈皓：经典的过桥问题）<\/li>\n<li>You are at a party with a friend and 10 people are present including you and the friend. your friend makes you a wager that for every person you find that has the same birthday as you, you get $1; for every person he finds that does not have the same birthday as you, he gets $2. would you accept the wager?<\/li>\n<li>How many piano tuners are there in the entire world?<\/li>\n<li>You have eight balls all of the same size. 7 of them weigh the same, and one of them weighs slightly more. How can you find the ball that is heavier by using a balance and only two weighings?（陈皓：经典的称重问题。这样的问题花样很多，不过都不难回答）<\/li>\n<li>You have five pirates, ranked from 5 to 1 in descending order. The top pirate has the right to propose how 100 gold coins should be divided among them. But the others get to vote on his plan, and if fewer than half agree with him, he gets killed. How should he allocate the gold in order to maximize his share but live to enjoy it? (Hint: One pirate ends up with 98 percent of the gold.)<\/li>\n<li>You are given 2 eggs. You have access to a 100-story building. Eggs can be very hard or very fragile means it may break if dropped from the first floor or may not even break if dropped from 100th floor. Both eggs are identical. You need to figure out the highest floor of a 100-story building an egg can be dropped without breaking. The question is how many drops you need to make. You are allowed to break 2 eggs in the process. （陈皓：从3的倍数的楼层开始扔，比如3，6，9，12&#8230;..，如果鸡蛋在3n层碎了，那到在3n-1层扔第二个鸡蛋，如果没碎，则最高不碎楼层为3n-1，否则为3n-2）<\/li>\n<li>Describe a technical problem you had and how you solved it.<\/li>\n<li>How would you design a simple search engine?<\/li>\n<li>Design an evacuation plan for San Francisco.<\/li>\n<li>There&#8217;s a latency problem in South Africa. Diagnose it. （陈皓：这个问题完全是在考你的解决问题的能力。没有明确的答案。不过，解决性能问题的第一步通常是找出瓶颈，找瓶颈有很多种方法，工具，二分查，时间记录等等。）<\/li>\n<li>What are three long term challenges facing Google?<\/li>\n<li>Name three non-Google websites that you visit often and like.  What do you like about the user interface and design?  Choose one of the three sites and comment on what new feature or project you would work on.  How would you design it?<\/li>\n<li>If there is only one elevator in the building, how would you change the design?  How about if there are only two elevators in the building? （陈皓：经典的电梯设计问题，这种问题千变万化，主要是考你的设计能力和需求变化的适变能力，与此相似的是酒店订房系统。）<\/li>\n<li>How many vacuum’s are made per year in USA?<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div>\n<div><strong>Software Engineer<\/strong><\/div>\n<div>\n<div>\n<ul>\n<li>Why are manhole covers round? （陈皓：为什么下水井盖是圆的？这是有N种答案的，上Wiki看看吧）<\/li>\n<li>What is the difference between a mutex and a semaphore?  Which one would you use to protect access to an increment operation?<\/li>\n<li>A man pushed his car to a hotel and lost his fortune. What happened? （陈皓：脑筋急转弯？他在玩大富翁游戏？！！）<\/li>\n<li>Explain the significance of &#8220;dead beef&#8221;.（陈皓：要是你看到的是16进制 DEAD BEEF，你会觉得这是什么？IPv6的地址？）<\/li>\n<li>Write a C program which measures the the speed of a context switch on a UNIX\/Linux system.<\/li>\n<li>Given a function which produces a random integer in the range 1 to 5, write a function which produces a random integer in the range 1 to 7.（陈皓：上StackOverflow看看吧，经典的问题）<\/li>\n<li>Describe the algorithm for a depth-first graph traversal.<\/li>\n<li>Design a class library for writing card games. （陈皓：用一系列的类来设计一个扑克游戏，设计题）<\/li>\n<li>You need to check that your friend, Bob, has your correct phone number, but you cannot ask him directly. You must write a the question on a card which and give it to Eve who will take the card to Bob and return the answer to you. What must you write on the card, besides the question, to ensure Bob can encode the message so that Eve cannot read your phone number?（陈皓：协议+数字加密，我试想了一个，纸条上可以这样写，“Bob，请把我的手机号以MD5算法加密后的字符串，比对下面的字符串——XXXXXX，它们是一样的吗？”）<\/li>\n<li>How are cookies passed in the HTTP protocol?<\/li>\n<li>Design the SQL database tables for a car rental database.<\/li>\n<li>Write a regular expression which matches a email address. （陈皓：上StackOverflow查相当的问题吧。）<\/li>\n<li>Write a function f(a, b) which takes two character string arguments and returns a string containing only the characters found in both strings in the order of a. Write a version which is order N-squared and one which is order N.（陈皓：算法题，不难，不说了。一个O(n^2)和一个O(n)的算法复杂度）<\/li>\n<li>You are given a the source to a application which is crashing when run. After running it 10 times in a debugger, you find it never crashes in the same place. The application is single threaded, and uses only the C standard library. What programming errors could be causing this crash? How would you test each one? （陈皓：和随机数有关系？或是时间？）<\/li>\n<li>Explain how congestion control works in the TCP protocol.<\/li>\n<li>In Java, what is the difference between final, finally, and finalize?<\/li>\n<li>What is multithreaded programming? What is a deadlock?<\/li>\n<li>Write a function (with helper functions if needed) called to Excel that takes an excel column value (A,B,C,D…AA,AB,AC,… AAA..) and returns a corresponding integer value (A=1,B=2,… AA=26..).<\/li>\n<li>You have a stream of infinite queries (ie: real time Google search queries that people are entering). Describe how you would go about finding a good estimate of 1000 samples from this never ending set of data and then write code for it.<\/li>\n<li>Tree search algorithms. Write BFS and DFS code, explain run time and space requirements. Modify the code to handle trees with weighted edges and loops with BFS and DFS, make the code print out path to goal state.<\/li>\n<li>You are given a list of numbers. When you reach the end of the list you will come back to the beginning of the list (a circular list). Write the most efficient algorithm to find the minimum # in this list. Find any given # in the list. The numbers in the list are always increasing but you don’t know where the circular list begins, ie: 38, 40, 55, 89, 6, 13, 20, 23, 36. （陈皓：循环排序数组的二分查找问题）<\/li>\n<li>Describe the data structure that is used to manage memory. (stack)<\/li>\n<li>What&#8217;s the difference between local and global variables?<\/li>\n<li>If you have 1 million integers, how would you sort them efficiently? (modify a specific sorting algorithm to solve this)<\/li>\n<li>In Java, what is the difference between static, final, and const. (if you don&#8217;t know Java they will ask something similar for C or C++).<\/li>\n<li>Talk about your class projects or work projects (pick something easy)… then describe how you could make them more efficient (in terms of algorithms).<\/li>\n<li>Suppose you have an NxN matrix of positive and negative integers. Write some code that finds the sub-matrix with the maximum sum of its elements.（陈皓：以前见过一维数组的这个问题，现在是二维的。感觉应该是把二维的第一行的最大和的区间算出来，然后再在这个基础之上进行二维的分析。思路应该是这个，不过具体的算法还需要想一想）<\/li>\n<li>Write some code to reverse a string.<\/li>\n<li>Implement division (without using the divide operator, obviously).（陈皓：想一想手算除法的过程。）<\/li>\n<li>Write some code to find all permutations of the letters in a particular string.<\/li>\n<li>What method would you use to look up a word in a dictionary? （陈皓：使用排序，哈希，树等算法和数据结构）<\/li>\n<li>Imagine you have a closet full of shirts. It’s very hard to find a shirt. So what can you do to organize your shirts for easy retrieval?<\/li>\n<li>You have eight balls all of the same size. 7 of them weigh the same, and one of them weighs slightly more. How can you fine the ball that is heavier by using a balance and only two weighings?<\/li>\n<li>What is the C-language command for opening a connection with a foreign host over the internet?<\/li>\n<li>Design and describe a system\/application that will most efficiently produce a report of the top 1 million Google search requests. These are the particulars: 1) You are given 12 servers to work with. They are all dual-processor machines with 4Gb of RAM, 4x400GB hard drives and networked together.(Basically, nothing more than high-end PC’s) 2) The log data has already been cleaned for you. It consists of 100 Billion log lines, broken down into 12 320 GB files of 40-byte search terms per line. 3) You can use only custom written applications or available free open-source software.<\/li>\n<li>There is an array A[N] of N numbers. You have to compose an array Output[N] such that Output[i] will be equal to multiplication of all the elements of A[N] except A[i]. For example Output[0] will be multiplication of A[1] to A[N-1] and Output[1] will be multiplication of A[0] and from A[2] to A[N-1]. Solve it without division operator and in O(n).（陈皓：注意其不能使用除法。算法思路是这样的，把output[i]=a[i]左边的乘积 x a[i]右边的乘积，所以，我们可以分两个循环，第一次先把A[i]左边的乘积放在Output[i]中，第二次把A[i]右边的乘积算出来。我们先看第一次的循环，使用迭代累积的方式，代码如下：for(r=1; i=0; i&lt;n-1; i++){ Output[i]=r; r*=a[i]; }，看明白了吧。第二次的循环我就不说了，方法一样的。）<\/li>\n<li>There is a linked list of numbers of length N. N is very large and you don’t know N. You have to write a function that will return k random numbers from the list. Numbers should be completely random. Hint: 1. Use random function rand() (returns a number between 0 and 1) and irand() (return either 0 or 1) 2. It should be done in O(n).（陈皓：本题其实不难。在遍历链表的同时一边生成随机数，一边记录最大的K个随机数和其链接地址。）<\/li>\n<li>Find or determine non existence of a number in a sorted list of N numbers where the numbers range over M, M&gt;&gt; N and N large enough to span multiple disks. Algorithm to beat O(log n) bonus points for constant time algorithm.（陈皓：使用bitmap，如果一个长整形有64位，那么我们可以使用M\/64个bitmap）<\/li>\n<li>You are given a game of Tic Tac Toe. You have to write a function in which you pass the whole game and name of a player. The function will return whether the player has won the game or not. First you to decide which data structure you will use for the game. You need to tell the algorithm first and then need to write the code. Note: Some position may be blank in the game। So your data structure should consider this condition also.<\/li>\n<li>You are given an array [a1 To an] and we have to construct another array [b1 To bn] where bi = a1*a2*&#8230;*an\/ai. you are allowed to use only constant space and the time complexity is O(n). No divisions are allowed.（陈皓：前面说过了）<\/li>\n<li>How do you put a Binary Search Tree in an array in a efficient manner. Hint :: If the node is stored at the ith position and its children are at 2i and 2i+1(I mean level order wise)Its not the most efficient way.（陈皓：按顺序遍历树）<\/li>\n<li>How do you find out the fifth maximum element in an Binary Search Tree in efficient manner. Note: You should not use use any extra space. i.e sorting Binary Search Tree and storing the results in an array and listing out the fifth element.<\/li>\n<li>Given a Data Structure having first n integers and next n chars. A = i1 i2 i3 &#8230; iN c1 c2 c3 &#8230; cN.Write an in-place algorithm to rearrange the elements of the array ass A = i1 c1 i2 c2 &#8230; in cn（陈皓：这个算法其实就是从中间开始交换元素，代码：for(i=n-1; i&gt;1; i++) {  for(j=i; j&lt;2*n-i; j+=2) { swap(a[j], a[j+1]); } }，不好意思写在同一行上了。）<\/li>\n<li>Given two sequences of items, find the items whose absolute number increases or decreases the most when comparing one sequence with the other by reading the sequence only once.<\/li>\n<li>Given That One of the strings is very very long , and the other one could be of various sizes. Windowing will result in O(N+M) solution but could it be better? May be NlogM or even better?<\/li>\n<li>How many lines can be drawn in a 2D plane such that they are equidistant from 3 non-collinear points?<\/li>\n<li>Let&#8217;s say you have to construct Google maps from scratch and guide a person standing on Gateway of India (Mumbai) to India Gate(Delhi). How do you do the same?<\/li>\n<li>Given that you have one string of length N and M small strings of length L. How do you efficiently find the occurrence of each small string in the larger one?<\/li>\n<li>Given a binary tree, programmatically you need to prove it is a binary search tree.<\/li>\n<li>You are given a small sorted list of numbers, and a very very long sorted list of numbers &#8211; so long that it had to be put on a disk in different blocks. How would you find those short list numbers in the bigger one?<\/li>\n<li>Suppose you have given N companies, and we want to eventually merge them into one big company. How many ways are theres to merge?<\/li>\n<li>Given a file of 4 billion 32-bit integers, how to find one that appears at least twice? （陈皓：我能想到的是拆分成若干个小数组，排序，然后一点点归并起来）<\/li>\n<li>Write a program for displaying the ten most frequent words in a file such that your program should be efficient in all complexity measures.（陈皓：你可能需要看看这篇文章<a href=\"http:\/\/www.cs.rutgers.edu\/~farach\/pubs\/FrequentStream.pdf\" target=\"_blank\"><span style=\"text-decoration: underline;\">Finding Frequent Items in Data Streams<\/span><\/a>）<\/li>\n<li>Design a stack. We want to push, pop, and also, retrieve the minimum element in constant time.<\/li>\n<li>Given a set of coin denominators, find the minimum number of coins to give a certain amount of change.（陈皓：你应该查看一下这篇文章：<a href=\"http:\/\/www.algorithmist.com\/index.php\/Coin_Change\" target=\"_blank\"><span style=\"text-decoration: underline;\">Coin Change Problem<\/span><\/a>）<\/li>\n<li>Given an array, i) find the longest continuous increasing subsequence. ii) find the longest increasing subsequence.（陈皓：这个题不难，O(n)算法是边遍历边记录当前最大的连续的长度。）<\/li>\n<li>Suppose we have N companies, and we want to eventually merge them into one big company. How many ways are there to merge?<\/li>\n<li>Write a function to find the middle node of a single link list. （陈皓：我能想到的算法是——设置两个指针p1和p2，每一次，p1走两步，p2走一步，这样，当p1走到最后时，p2就在中间）<\/li>\n<li>Given two binary trees, write a compare function to check if they are equal or not. Being equal means that they have the same value and same structure.（陈皓：这个很简单，使用递归算法。）<\/li>\n<li>Implement put\/get methods of a fixed size cache with LRU replacement algorithm.<\/li>\n<li>You are given with three sorted arrays ( in ascending order), you are required to find a triplet ( one element from each array) such that distance is minimum. Distance is defined like this : If a[i], b[j] and c[k] are three elements then distance=max(abs(a[i]-b[j]),abs(a[i]-c[k]),abs(b[j]-c[k]))&#8221; Please give a solution in O(n) time complexity（陈皓：三个指针，a, b, c分别指向三个数组头，假设：a[0]&lt;b[0]&lt;c[0]，推进a直到a[i]&gt;b[0]，计算 abs(a[i-1] &#8211; c[0])，把结果保存在min中。现在情况变成找 a[i], b[0],c[0]，重复上述过程，如果有一个新的值比min要小，那就取代现有的min。）<\/li>\n<li>How does C++ deal with constructors and deconstructors of a class and its child class?<\/li>\n<li>Write a function that flips the bits inside a byte (either in C++ or Java). Write an algorithm that take a list of n words, and an integer m, and retrieves the mth most frequent word in that list.<\/li>\n<li>What&#8217;s 2 to the power of 64?<\/li>\n<li>Given that you have one string of length N and M small strings of length L. How do you efficiently find the occurrence of each small string in the larger one? （陈皓：我能想到的是——把那M个小字串排个序，然后遍历大字串，并在那M个字串中以二分取中的方式查找。）<\/li>\n<li>How do you find out the fifth maximum element in an Binary Search Tree in efficient manner.<\/li>\n<li>Suppose we have N companies, and we want to eventually merge them into one big company. How many ways are there to merge?<\/li>\n<li>There is linked list of millions of node and you do not know the length of it. Write a function which will return a random number from the list.<\/li>\n<li>You need to check that your friend, Bob, has your correct phone number, but you cannot ask him directly. You must write a the question on a card which and give it to Eve who will take the card to Bob and return the answer to you. What must you write on the card, besides the question, to ensure Bob can encode the message so that Eve cannot read your phone number?<\/li>\n<li>How long it would take to sort 1 trillion numbers? Come up with a good estimate.<\/li>\n<li>Order the functions in order of their asymptotic performance: 1) 2^n 2) n^100 3) n! 4) n^n<\/li>\n<li>There are some data represented by(x,y,z). Now we want to find the Kth least data. We say (x1, y1, z1) &gt; (x2, y2, z2) when value(x1, y1, z1) &gt; value(x2, y2, z2) where value(x,y,z) = (2^x)*(3^y)*(5^z). Now we can not get it by calculating value(x,y,z) or through other indirect calculations as lg(value(x,y,z)). How to solve it?<\/li>\n<li>How many degrees are there in the angle between the hour and minute hands of a clock when the time is a quarter past three?<\/li>\n<li>Given an array whose elements are sorted, return the index of a the first occurrence of a specific integer. Do this in sub-linear time. I.e. do not just go through each element searching for that element.<\/li>\n<li>Given two linked lists, return the intersection of the two lists: i.e. return a list containing only the elements that occur in both of the input lists. （陈皓：把第一个链表存入hash表，然后遍历第二个链表。不知道还没有更好的方法。）<\/li>\n<li>What&#8217;s the difference between a hashtable and a hashmap?<\/li>\n<li>If a person dials a sequence of numbers on the telephone, what possible words\/strings can be formed from the letters associated with those numbers?（陈皓：这个问题和美国的电话有关系，大家可以试着想一下我们发短信的手机，按数字键出字母，一个组合的数学问题。）<\/li>\n<li>How would you reverse the image on an n by n matrix where each pixel is represented by a bit?<\/li>\n<li>Create a fast cached storage mechanism that, given a limitation on the amount of cache memory, will ensure that only the least recently used items are discarded when the cache memory is reached when inserting a new item. It supports 2 functions: String get(T t) and void put(String k, T t).<\/li>\n<li>Create a cost model that allows Google to make purchasing decisions on to compare the cost of purchasing more RAM memory for their servers vs. buying more disk space.<\/li>\n<li>Design an algorithm to play a game of Frogger and then code the solution. The object of the game is to direct a frog to avoid cars while crossing a busy road. You may represent a road lane via an array. Generalize the solution for an N-lane road.<\/li>\n<li>What sort would you use if you had a large data set on disk and a small amount of ram to work with?<\/li>\n<li>What sort would you use if you required tight max time bounds and wanted highly regular performance.<\/li>\n<li>How would you store 1 million phone numbers?（陈皓：试想电话是有区段的，可以把区段统一保存，Flyweight设计模式）<\/li>\n<li>Design a 2D dungeon crawling game. It must allow for various items in the maze &#8211; walls, objects, and computer-controlled characters. (The focus was on the class structures, and how to optimize the experience for the user as s\/he travels through the dungeon.)<\/li>\n<li>What is the size of the C structure below on a 32-bit system? On a 64-bit? （陈皓：注意编译器的对齐）<\/li>\n<\/ul>\n<p style=\"padding-left: 90px;\">struct foo {<\/p>\n<div style=\"padding-left: 90px;\">char a;<\/div>\n<div style=\"padding-left: 90px;\">char* b;<\/div>\n<div style=\"padding-left: 90px;\">};<\/div>\n<\/div>\n<\/div>\n<div><strong>Software Engineer in Test<\/strong><\/div>\n<div>\n<ul>\n<li>Efficiently implement 3 stacks in a single array.<\/li>\n<li>Given an array of integers which is circularly sorted, how do you find a given integer.<\/li>\n<li>Write a program to find depth of binary search tree without using recursion.<\/li>\n<li>Find the maximum rectangle (in terms of area) under a histogram in linear time.<\/li>\n<li>Most phones now have full keyboards. Before there there three letters mapped to a number button. Describe how you would go about implementing spelling and word suggestions as people type.<\/li>\n<li>Describe recursive mergesort and its runtime. Write an iterative version in C++\/Java\/Python.<\/li>\n<li>How would you determine if someone has won a game of tic-tac-toe on a board of any size?<\/li>\n<li>Given an array of numbers, replace each number with the product of all the numbers in the array except the number itself *without* using division.<\/li>\n<li>Create a cache with fast look up that only stores the N most recently accessed items.<\/li>\n<li>How to design a search engine? If each document contains a set of keywords, and is associated with a numeric attribute, how to build indices?<\/li>\n<li>Given two files that has list of words (one per line), write a program to show the intersection.<\/li>\n<li>What kind of data structure would you use to index annagrams of words? e.g. if there exists the word &#8220;top&#8221; in the database, the query for &#8220;pot&#8221; should list that.<\/li>\n<\/ul>\n<div>\n<div><strong>Quantitative Compensation Analyst<\/strong><\/div>\n<\/div>\n<\/div>\n<div>\n<ul>\n<li>What is the yearly standard deviation of a stock given the monthly standard deviation?<\/li>\n<li>How many resumes does Google receive each year for software engineering?<\/li>\n<li>Anywhere in the world, where would you open up a new Google office and how would you figure out compensation for all the employees at this new office?<\/li>\n<li>What is the probability of breaking a stick into 3 pieces and forming a triangle?<\/li>\n<\/ul>\n<\/div>\n<div><strong>Engineering Manager<\/strong><\/div>\n<div>\n<ul>\n<li>You&#8217;re the captain of a pirate ship, and your crew gets to vote on how the gold is divided up. If fewer than half of the pirates agree with you, you die. How do you recommend apportioning the gold in such a way that you get a good share of the booty, but still survive?<\/li>\n<\/ul>\n<\/div>\n<div><strong>AdWords Associate<\/strong><\/div>\n<div>\n<ul>\n<li>How would you work with an advertiser who was not seeing the benefits of the AdWords relationship due to poor conversions?<\/li>\n<li>How would you deal with an angry or frustrated advertisers on the phone?<\/li>\n<\/ul>\n<\/div>\n<div><span style=\"font-size: small;\"><em>Sources<\/em><\/span><\/div>\n<div style=\"padding-left: 30px;\"><span><span style=\"font-size: small;\"><a href=\"http:\/\/news.ycombinator.com\/item?id=266663\" target=\"_blank\">http:\/\/news.ycombinator.com\/item?id=266663<\/a> <\/span><\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/tihomir.org\/crazy-questions-at-google-job-interview\/\" target=\"_blank\">http:\/\/tihomir.org\/crazy-questions-at-google-job-interview\/<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/www.drizzle.com\/~jpaint\/google.html\" target=\"_blank\">http:\/\/www.drizzle.com\/~jpaint\/google.html<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/www.gamedev.net\/community\/forums\/topic.asp?topic_id=299692\" target=\"_blank\">http:\/\/www.gamedev.net\/community\/forums\/topic.asp?topic_id=299692<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/careers.cse.sc.edu\/googleinterview\" target=\"_blank\">http:\/\/careers.cse.sc.edu\/googleinterview<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/job-interview.blogspot.com\/2005\/02\/google-interview-product-marketing.html\" target=\"_blank\">http:\/\/job-interview.blogspot.com\/2005\/02\/google-interview-product-marketing.html<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/www.theregister.co.uk\/2007\/01\/05\/google_interview_tales\/\" target=\"_blank\">http:\/\/www.theregister.co.uk\/2007\/01\/05\/google_interview_tales\/<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/money.cnn.com\/2007\/08\/29\/technology\/brain_teasers.biz2\/index.htm\" target=\"_blank\">http:\/\/money.cnn.com\/2007\/08\/29\/technology\/brain_teasers.biz2\/index.htm<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/money.cnn.com\/2007\/08\/29\/technology\/brain_teasers.biz2\/index.htm\" target=\"_blank\">http:\/\/blogs.lessthandot.com\/index.php\/ITProfessionals\/EthicsIT\/google-interview-questions<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/placementsindia.blogspot.com\/2007\/09\/google-top-interview-puzzles.html\" target=\"_blank\">http:\/\/placementsindia.blogspot.com\/2007\/09\/google-top-interview-puzzles.html<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/linkmingle.com\/user\/interview_questions\/google_interview_questions\" target=\"_blank\">http:\/\/linkmingle.com\/user\/interview_questions\/google_interview_questions<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/discuss.joelonsoftware.com\/default.asp?interview.11.626758.33\" target=\"_blank\">http:\/\/discuss.joelonsoftware.com\/default.asp?interview.11.626758.33<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/mindcipher.com\/puzzle\/78-clock-works\" target=\"_blank\">http:\/\/mindcipher.com\/puzzle\/78-clock-works<\/a><br \/>\n<\/span><\/div>\n<div style=\"padding-left: 30px;\"><span style=\"font-size: small;\"><a href=\"http:\/\/www.glassdoor.com\" target=\"_blank\">http:\/\/www.glassdoor.com<\/a><\/span><\/div>\n<div style=\"padding-left: 30px;\">\n<div><span style=\"font-size: small;\"><a href=\"http:\/\/bluepixel.ca\/blog\/?p=69\" target=\"_blank\">http:\/\/bluepixel.ca\/blog\/?p=69<\/a><\/span><\/div>\n<div><span style=\"font-size: small;\"> <\/span><span style=\"font-size: small;\"><a href=\"http:\/\/www.businessinsider.com\/my-nightmare-interviews-with-google-2009-11\" target=\"_blank\">http:\/\/www.businessinsider.com\/my-nightmare-interviews-with-google-2009-11<\/a><\/span><\/div>\n<div><span style=\"font-size: small;\"><br \/>\n<\/span><\/div>\n<\/div>\n<\/div>\n<p>（全文完）<\/p>\n","raw":"","protected":false},"excerpt":{"rendered":"<p>来源：http:\/\/blog.seattleinterviewcoach.com\/2009\/02\/140-google-interview-questions&#8230;.<\/p>\n<p class=\"read-more\"><a class=\"btn btn-default\" href=\"https:\/\/coolshell.cn\/articles\/3345.html\"> Read More<span class=\"screen-reader-text\">  Read More<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[39,271],"tags":[32,70,514,58,164],"series":[],"aioseo_notices":[],"views":87385,"post_thumbnail_image":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg","content_first_image":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg","post_medium_image_300":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg","post_thumbnail_image_624":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg","post_frist_image":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg","post_medium_image":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg","post_large_image":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg","post_full_image":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion.jpg","post_all_images":[{"imagesurl":"https:\/\/coolshell.cn\/wp-content\/uploads\/2010\/12\/googlequestion-300x225.jpg","id":"image0"}],"videoAdId":"","listAd":"0","listAdId":"","listAdEvery":5,"total_comments":27,"category_name":"职场生涯","post_date":"2010-12-02","like_count":"0","praiseWord":"鼓励","excitationAd":"0","rewardedVideoAdId":"","detailAdId":"","detailAd":"0","enterpriseMinapp":"0","audios":[],"postImageUrl":"http:\/\/coolshell.cn\/wp-content\/uploads\/2016\/09\/coolshell-360x200.jpg","avatarurls":[],"related_posts":[{"ID":"22298","post_title":"聊聊团队协同和协同工具"},{"ID":"22398","post_title":"我看ChatGPT: 为啥谷歌掉了千亿美金"}],"pageviews":87386,"pageviews_wl":16720,"ratings_average":4,"ratings_total":97,"ratings_users":24,"next_post_id":3738,"next_post_title":"打印质数的各种算法","previous_post_id":3281,"previous_post_title":"架构师给程序员的一封信"}