{"id":8031,"date":"2012-08-12T16:02:28","date_gmt":"2012-08-12T08:02:28","guid":{"rendered":"http:\/\/coolshell.cn\/?p=8031"},"modified":"2012-08-12T22:59:36","modified_gmt":"2012-08-12T14:59:36","slug":"infoq%e7%9a%84archsummit%e5%a4%a7%e4%bc%9a%e5%af%b9%e6%88%91%e7%9a%84%e9%87%87%e8%ae%bf","status":"publish","type":"post","link":"https:\/\/coolshell.cn\/articles\/8031.html","title":{"rendered":"InfoQ的ArchSummit大会对我的采访"},"content":{"rendered":"<p>偷个懒，做个更新，今天下午InfoQ的ArchSummit对我的一些采访。我整理了一下，算做是我个人写酷壳的一些想法和总结。不过问我的这些问题并不尖锐，呵呵，不像<a href=\"http:\/\/weibo.com\/stonemama\" target=\"_blank\">@图灵谢工<\/a> 问我的问题：“你的价值观太过理想，根本不现实，你站在道德的高点拷问社会，是不是想炒作自己？”。<\/p>\n<p><strong>1) 作为酷壳的博主，请您大概介绍下酷壳是什么时候开始的，初衷是什么 ？<\/strong><\/p>\n<p>我写blog是从2002年开始（那时还没有blog这个词），当时对我来说，没有自己的电脑，上网很不方便，而我有写学习笔记的习惯，读书和工作中学到的一些东西需要保存在某个地方，我希望这个地方可以让我在任何地方都可以调出来看看（因为我当时的工作出差太多），正好当时的CSDN有个“专家专栏”的功能，也就是后来出现的blog。<\/p>\n<p>后来Blog出现后，CSDN把自己的“专家专栏”全部迁移到了blog.csdn.net上，07-08年这段时间，CSDN的blog基本上是不能使用，性能差得不能再差，每天宕机，上传图片，贴代码，都非常不好用。也许，这就是使用.NET\/Windows平台的问题（开个玩笑）。<\/p>\n<p>我是从2009年3月开始创建酷壳的，创建的初衷如下：<\/p>\n<ul>\n<li>我需要一个更稳定，更方便的地方，我的博客的风格不会被大众的风格所掩盖的地方。<\/li>\n<li>我的从事新闻的老婆很不待见<a href=\"http:\/\/blog.csdn.net\/haoel\" target=\"_blank\">我在CSDN的博客<\/a>，她觉得太技术，书呆子。<\/li>\n<li>我正好看到了煎蛋这个国外娱乐新闻文摘的blog，而我正好每天会有2个小时阅读国外社区的东西。<\/li>\n<\/ul>\n<p>基于上述三个原因，我自己花了4500元\/年租了个主机，建了酷壳。所以，这也是你一开始看到酷壳基本上是娱乐性比较强的博客，我收集一些比较有意思的程序员中发生的事情，也收集一各式各样的程序员圈子里的各处观点。<\/p>\n<p>我当时的想法是，一些特别技术的东西，我会和CSDN同步，而一些轻松的话题，我会放在酷壳。我当时的初衷就是想说明程序员并不是一个木纳、书呆子、不食人间烟火、巨无趣的一个群体，程序员圈子里同样也有很多有趣的东西。所以，你可以看到11年初以前的东西我有很多网络恶搞式乱调侃的语言。<\/p>\n<p><!--more--><\/p>\n<p>但到了2011年初让我开始让我有些转变，主要是读者越来越多，而且，有一些人已经把酷壳当成了一个提升自己能力和、开阔眼界、甚至需要指导的地方，我的压力就这样来了，这种压力让我开始不能太娱乐，因为有一些人是很认真地在看酷壳的文章，在期待能从酷壳获得有价值的东西……<\/p>\n<p><strong>2）技术人员的个人博客不胜其数，但真正可以吸引人眼球的并不多，能谈谈成功运营一个个人博客的精髓是什么？<\/strong><\/p>\n<p>哪有什么运营，完全是顺其自然，误打误撞。<\/p>\n<p>是的，技术人员的博客太多了，酷壳并不是技术最好的，也不是资讯最好的。淘宝的很多技术团队的博客都很不错，还有阮一峰的博客，还有各种各样的如CSDN，博客园，51CTO，ZDNET这样的社区。所以，我需要做点不一样的，而且我觉得还有一些这些社区和博客都还没有涉及的地方。<\/p>\n<p>对于社区最大的问题就是，他们就像我们学校里的学生一样，喜欢大量地收获聚集文章和知识，填鸭式的网站，网站的编辑不懂技术。对于一些技术博客的问题并不是他们不懂技术，而是太过技术，只有技术，少了一些程序员的文化，观点和视野。<\/p>\n<p>程序员是一个圈子，一个小社会，这个圈子里并不只有技术和知识，还有很多很多的东西，例如：程序员们都说自己比较辛苦，都说自己没有得到足够的尊重，还有一些如敏捷，流程，产品等地方程序员的观点没有得到表达，还有一些程序员这个社区内比较特有的东西，比如：编程语言之争，这本是一个很好的话题，是程序员圈子里的文化，但是每次讨论都是骂来骂去的，需要有人去引导程序员，带领他们用正确的价值观去看待和思考这些东西。<\/p>\n<p>这就是酷壳和其它博客和社区不一样的地方，我关注的并不只有技术，还有程序员的文化和想法，并且输出一些或偏执或鲜明或个人或激进的价值观，无论怎么样，你认同也好，不认同也可以，你可以看到酷壳和我还有酷壳里的讨论都是真实的。<\/p>\n<p><strong>3）根据你博客的自我介绍，想从纯底层技术方向转型为业务技术方向，让你产生这种想法的最大原因是什么？<\/strong><\/p>\n<p>纯底层做得太多了，有些书呆子了，与人打交道有问题了，而且觉得地底有点不识人间烟火了，我想知道用户是怎么用我们的产品的，我想知道用户是怎么想的，整天在那调网络性能，调系统性能，搞多线程，搞内存漏洞，整天在矿道里打洞， 想出来见见天日。呵呵。<\/p>\n<p>但这并不代码我觉得业务和用户要比技术有用得多，也并不是说技术无用论。<\/p>\n<p>我觉得这就好像一颗大树，这些底层的技术，可以让你站得非常非常稳，可以让你抵御洪灾和暴风，但是如果你想伸长得更高更广，你还是需要地面上的枝叶。我觉得我的底层知识够深入了，我需要了解业务知识和用户，因为我不但想站得稳，扎得深，我也想伸得高。<\/p>\n<p><strong>4）酷壳产出文章是怎么样的频率？每篇博文 ，你大概需要多少时间？<\/strong><\/p>\n<p>我每天都有阅读的习惯，尤其是阅读网文，每天两个小时，而且我是一个爱思考的人，思考的对不对不一定，但是我很喜欢去思考。现在又上了微博和一些朋友互动，也会引发我的一些思考，所以，文章就是在阅读、交流和思考中产生的。<\/p>\n<p>2011年初以前，平均每周3篇，有时候一周有10篇，现在基本上每周一篇。以前的文章花不了太多时间 ，因为比较娱乐，现在的文章很花时间，比如《程序员练级攻略》花了我四周的时间 ，《性能调优攻略》花了我三周多的时间，基本上来说，现在的文章至少也要花我1-2天的时间。我想把文章的数量降下来，这样，我可以思考得更好更透彻一些，这样文章里的营养更多一些。<\/p>\n<p><strong>5）是不是可以给年轻的朋友，或是风刚从事软件开发工作的朋友，一些职业发展的建议？<\/strong><\/p>\n<p>主要是下面几点：<\/p>\n<ul>\n<li>不要追新技术，应该多看看那些经历了很长时间的常青的技术。<\/li>\n<\/ul>\n<ul>\n<li>多研究一下历史，和技术的演进，这样你才能知道技术的未来。今天的很多东西都在过去有身影，如：今天的移动端和云端架构和以前的Unix和终端的关系，还有管道，和Unix设计的哲学也在今天Service Interface式的设计中有得到传承，等等。<\/li>\n<\/ul>\n<ul>\n<li>我可以急功近利以解决问题和追赶技术潮流，但是，如果你需要成为一个领域的专家，你需要非常非常注重基础。速成编程的方式只能让你成为劳动力，而不能成为工匠或技术和知识的驾驭者。<\/li>\n<\/ul>\n<ul>\n<li>不要被产商的文化所主导了，多看看社区的文化，尤其是Unix\/C的文化，这是计算机文化的根（参看我写过的《<a title=\"Unix传奇(上篇)\" href=\"https:\/\/coolshell.cn\/articles\/2322.html\" target=\"_blank\">Unix传奇<\/a>》）<\/li>\n<\/ul>\n<ul>\n<li>注重基础，广度是深度是副产品。<\/li>\n<\/ul>\n<p><strong>6）以你过往的经历，你是如何看待“架构师”这个角色的？他的义务是如何分配的？<\/strong><\/p>\n<p>架构就是Design一个部分，就是软件设计的一块，软件设计最重要的有两点：<\/p>\n<ul>\n<li>业务功能性需求分析和非功能性需求分析，<\/li>\n<li>技术基础的深刻认识，需要有非常丰富的经验。<\/li>\n<\/ul>\n<p>试问一下，程序员做软件不需要设计吗？做设计不需要设计架构吗？很自然的，今天的工程师，程序员已经在做架构设计上的事了。所以，我觉得架构设计这个工作本就是程序员（或者说是高级程序员）工作的一部分。<\/p>\n<p>但是，我个人认为架构师在某些情况下也还是需要的，但其应该是对业务和技术都很熟悉的人，并且偏技术，也要写代码的人。在一些公司，上下一盘棋，的确需要对总体架构设计，并保证这个框架能够被各个工程团队贯彻实现的那么一个团队，但他们应该更多地深入到一线工程团队的。<\/p>\n<p>所以，我觉得架构师就是一个高级程序员，而不是一个拍脑袋，关说不练的人。<\/p>\n<p>这点，看看Linux的架构师团队就知道了，一样的需要写代码，fix-bug，一样地需要了解各个公司对linux提出的各种各样的需求。<\/p>\n<p><strong>7）现阶段酷壳的文章，都是你一个人写的吗？是否有其他同仁加入写作？<\/strong><\/p>\n<p>并不都是我一个人写的，我希望酷壳是大家一起来写的，事实上也有一些人写，只是不多。只是我个人的色彩过重了一些，我的个性压制了众性。<\/p>\n<p>（不过，我真的无法自证都是我写的，我有没有团队，呵呵，管它有没有团队，是不是人代写，重要的是那些文章的内容是否对大家有帮助，或是对社区有贡献。；））<\/p>\n<p><strong>8）你对酷壳未来的构想是什么？还是一个技术交流的平台吗？<\/strong><\/p>\n<p>对于酷壳来说，其文化和价值观比较重一些，短期内，还是以我个人色彩为主一些，虽然我希望这是一个大家都能来分享的地方。前段时间我有个想法想做一个“程序员疫苗站”，就像我们一出生时接种的各种疫苗可以让我们抵抗各种病毒一样，这个网站可以让程序员接种一些犯低级错误的疫苗，从而对这些低级错误有抵抗。我还没有想得特别清楚，不过方向基本上是这个方面的。<\/p>\n<p>（全文完）<\/p>\n","raw":"","protected":false},"excerpt":{"rendered":"<p>偷个懒，做个更新，今天下午InfoQ的ArchSummit对我的一些采访。我整理了一下，算做是我个人写酷壳的一些想法和总结。不过问我的这些问题并不尖锐，呵呵，不&#8230;<\/p>\n<p class=\"read-more\"><a class=\"btn btn-default\" href=\"https:\/\/coolshell.cn\/articles\/8031.html\"> Read More<span class=\"screen-reader-text\">  Read More<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[10],"tags":[139,487,70,58],"series":[],"aioseo_notices":[],"views":26794,"post_thumbnail_image":"","content_first_image":"","post_medium_image_300":"","post_thumbnail_image_624":"","post_frist_image":"","post_medium_image":"","post_large_image":"","post_full_image":"","post_all_images":[],"videoAdId":"","listAd":"0","listAdId":"","listAdEvery":5,"total_comments":66,"category_name":"杂项资源","post_date":"2012-08-12","like_count":"0","praiseWord":"鼓励","excitationAd":"0","rewardedVideoAdId":"","detailAdId":"","detailAd":"0","enterpriseMinapp":"0","audios":[],"postImageUrl":"http:\/\/coolshell.cn\/wp-content\/uploads\/2016\/09\/coolshell-360x200.jpg","avatarurls":[],"related_posts":[{"ID":"22298","post_title":"聊聊团队协同和协同工具"}],"pageviews":26795,"pageviews_wl":10773,"ratings_average":4,"ratings_total":99,"ratings_users":24,"next_post_id":8088,"next_post_title":"对技术的态度","previous_post_id":7992,"previous_post_title":"C++的坑真的多吗？"}